# Taps
tap "caskroom/cask"
tap "caskroom/eid"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"

# Cask Dependencies
brew "mas"
brew "pkg-config"
cask "java"

# Shells
brew "bash"
brew "zsh"
brew "zsh-completions"

# CLI Utilities
brew "coreutils"
brew "curl", args: ["with-nghttp2"]
brew "git"
brew "grep"
brew "tree"
brew "wget"

# macOS Tools
brew "mackup"
brew "trash"

# Other Tools
# Disabled until https://github.com/Homebrew/homebrew-core/issues/32673 is resolved
# brew "imagemagick", args: ["with-fftw", "with-hdri", "with-liblqr", "with-librsvg", "with-opencl", "with-openmp", "with-webp"]
brew "imagemagick"

# Development
brew "composer"
brew "go"
brew "php"
brew "pyenv"
brew "node"
brew "yarn"

# Apps
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "caffeine"
cask "docker"
cask "dropbox"
cask "droplr"
cask "eid-pt"
cask "google-cloud-sdk"
cask "grammarly"
cask "iterm2"
cask "now"
cask "postbox"
cask "postman"
cask "sequel-pro"
cask "slack"
cask "tableplus"
cask "tower"
cask "vanilla"
cask "vlc"
cask "visual-studio-code"

# Screensavers
cask "aerial"

# Browsers
cask "firefox"
cask "google-chrome"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"

# Fonts
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# MAS Applications
mas "Bear", id: 1091189122
mas "Clocker", id: 1056643111
